#include "ClientThread.h"
//------------------------------------------------------------------------------
#include "TcpServer.h"
//------------------------------------------------------------------------------
using namespace Bicycle;
//------------------------------------------------------------------------------
ClientThread::ClientThread(TcpServer* server,SOCKET clientSocket)
  :Thread(),
   server_(server),
   // создаем класс-клиент по переданному дескриптору сокета:
   client_(new  TcpClient(clientSocket))
{
}
//------------------------------------------------------------------------------
ClientThread::~ClientThread()
{
  delete client_;
}
//------------------------------------------------------------------------------
/*virtual*/ void ClientThread::run()
{
  // Вызываем виртуальный метод сервера отвечающий за обработку
  // каждого клиента (из потока!! потому стоит помнить потокобезопастности)
  server_->workWithClientInThread(client_);
}
//------------------------------------------------------------------------------

